In [5]:
import pandas as pd
import numpy as np

In [6]:
RawData = { "Day":['9/4', '9/5', '9/6', '9/7', '9/8', '9/9', '9/10', '9/11'],
            "Revenue":[100, 120, 130, 110, 200, 160, 100, 180],
            "Cost":[10.0, 10.0, 13.0, 11.0, np.nan, 16.0, 10.0, np.nan]}
df = pd.DataFrame(RawData)
df

    Day  Revenue  Cost
0   9/4      100  10.0
1   9/5      120  10.0
2   9/6      130  13.0
3   9/7      110  11.0
4   9/8      200   NaN
5   9/9      160  16.0
6  9/10      100  10.0
7  9/11      180   NaN

**1. 使用where: 讓不符合的值變成NaN**

In [4]:
mask = df['Day'] != '9/4' 
df.where(mask)

    Day  Revenue  Cost
0   NaN      NaN   NaN
1   9/5    120.0  10.0
2   9/6    130.0  13.0
3   9/7    110.0  11.0
4   9/8    200.0  20.0
5   9/9    160.0  16.0
6  9/10    100.0  10.0
7  9/11    180.0  18.0

**2.使用dropna()**

2.1 dropna()
 <br>
只要一個NaN就會整row刪除

In [18]:
df = df.dropna()
df

    Day  Revenue  Cost
0   9/4      100  10.0
1   9/5      120  10.0
2   9/6      130  13.0
3   9/7      110  11.0
5   9/9      160  16.0
6  9/10      100  10.0

2.2 dropna(how='all')
 <br>
要全部NaN就，才會刪除整個row

In [3]:
df.dropna(how='all')
df

    Day  Revenue  Cost
0   9/4      100  10.0
1   9/5      120  10.0
2   9/6      130  13.0
3   9/7      110  11.0
4   9/8      200   NaN
5   9/9      160  16.0
6  9/10      100  10.0
7  9/11      180   NaN

2.2 dropna(thresh=1)
 <br>
要全部NaN就，才會刪除整個row